#+TITLE: My GTD Style Workflow
#+AUTHOR: 胡琛

* Work

** Tasks
*** DONE 联系甄赏修改混沌书
    CLOSED: [2017-03-03 周五 11:20] SCHEDULED: <2017-03-03 周五 10:30>
    :PROPERTIES:
    :CREATED:  [2017-03-03 周五 10:25]
    :END:
*** WAITING 王雄混沌书更换模版                                      :WAITING:
    SCHEDULED: <2017-03-07 周二 10:02>
    :PROPERTIES:
    :CREATED:  [2017-03-07 周二 10:01]
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-07 周二 10:02]--[2017-03-07 周二 10:08] =>  0:06
    :END:
** Projects
*** DONE 王雄的混沌书精修版本 1 [14/14]
    CLOSED: [2017-03-04 周六 19:51] SCHEDULED: <2017-03-04 周六 10:30> DEADLINE: <2017-03-05 周日 14:00>
    :LOGBOOK:
    CLOCK: [2017-03-04 周六 19:56]--[2017-03-04 周六 20:18] =>  0:22
    CLOCK: [2017-03-04 周六 19:05]--[2017-03-04 周六 19:51] =>  0:46
    CLOCK: [2017-03-04 Sat 15:56]--[2017-03-04 Sat 16:20] =>  0:24
    CLOCK: [2017-03-04 周六 13:23]--[2017-03-04 周六 13:52] =>  0:29
    CLOCK: [2017-03-04 周六 13:12]--[2017-03-04 周六 13:22] =>  0:10
    CLOCK: [2017-03-04 周六 12:42]--[2017-03-04 周六 13:07] =>  0:25
    CLOCK: [2017-03-04 周六 11:04]--[2017-03-04 周六 11:29] =>  0:25
    CLOCK: [2017-03-04 周六 10:34]--[2017-03-04 周六 10:59] =>  0:25
    CLOCK: [2017-03-03 周五 18:20]--[2017-03-03 周五 19:47] =>  1:27
    CLOCK: [2017-03-03 周五 17:18]--[2017-03-03 周五 17:25] =>  0:07
    CLOCK: [2017-03-03 周五 15:26]--[2017-03-03 周五 15:51] =>  0:25
    CLOCK: [2017-03-03 周五 10:41]--[2017-03-03 周五 11:06] =>  0:25
    CLOCK: [2017-03-02 周四 22:17]--[2017-03-02 周四 22:31] =>  0:14
    CLOCK: [2017-03-02 Thu 11:31]--[2017-03-02 Thu 11:56] =>  0:25
    :END:
   
    - [X] 制作进度表
    - [X] Leading chapter 中的 "Organization of the Book" 中，添加所有章节 Abstract
    - [X] 第三章作者名与机构名修改 (前面是王雄的文章，New Discoveries 是别人的文章，需要修改)
    - [X] 表格居中设置
    - [X] 与 latex 模板有关的处理
      - [X] Caption 居中设置 (模板默认设置为左对齐)
      - [X] pdf 页眉设置，最好有短标题 (模板问题，后面再说)
      - [X] 公式编号修改为按章节编号 (与模板有关)
      - [X] 作者名，机构名，邮箱，大小写修改(从网上找到的自定义命令，没有找到设置大小写的命令，原模板是没有单独设置章节作者的)
      - [X] Abstract 与作者名放入同页面 (容易修改，但是由于作者名信息字体太大等原因，修改后并不好看)
      - [X] 参考文献引用改为超链接
    - [X] 第三章 'One Equi' 图片格式修改
    - [X] 公式格式修改
    - [X] 表格位置调整 (反复修改，问题太多，建议直接问原作者要源码)
      - Chaos System with One Equilibrium (来自两篇文章 王雄的 thesis 和
        MALIHE MOLAIE and SAJAD JAFARI 的
        SIMPLE CHAOTIC FLOWS WITH ONE STABLE EQUILIBRIUM,文章中的超长表格我分割为两个表格处理，但不好看，还是
        建议问 Sajad 要 latex 源码)
      - Chao System with No Equilibrium (来自两篇文章，Zhaochao Wei 的
         Dynamical behaviors of a chaotic system with no equilibria *可能需要他的授权* 
         另外一篇来自 Sajad Elementary quadratic chaotic flows with no equilibria，表格极难调整，
         建议直接索要他的 latex 源码)
    - [X] 图片引用问号
    - [X] 图片大小与 Caption
    - [X] 文字乱码
    - [X] 图片分辨率调整
    - [X] 参考文献格式修改 (统一格式，包括字体是否斜体，是否包含网址，在 pdf 中的位置，可能涉及到模板使用)
    - [X] 第二章参考文献格式可能有问题 (没有问题，可能是因为参考文献比较少，显得比较怪异)
  
*** TODO 程序化短课 [2/3]
    SCHEDULED: <2017-03-01 周三 11:30>
    :LOGBOOK:
    CLOCK: [2017-03-01 周三 12:26]--[2017-03-01 周三 12:51] =>  0:25
    CLOCK: [2017-03-01 周三 11:31]--[2017-03-01 周三 11:56] =>  0:25
    :END:
    
     - [X] 资料整理
     - [X] 讲义准备
     - [ ] 课件准备
       - [ ] Week 1
       - [ ] Week 2
       - [ ] Week 3
       - [ ] Week 4
       - [ ] Week 5
       - [ ] Week 6
     - [ ] 作业准备

* Private

** Tasks
*** DONE 学习使用 ditaa
    CLOSED: [2017-03-05 周日 10:31] SCHEDULED: <2017-03-05 周日 10:00>
    :PROPERTIES:
    :CREATED:  [2017-03-03 周五 10:23]
    :Effort:   30
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-05 周日 10:00]--[2017-03-05 周日 10:25] =>  0:25
    CLOCK: [2017-03-03 周五 13:52]--[2017-03-03 周五 14:06] =>  0:14
    CLOCK: [2017-03-03 周五 13:38]--[2017-03-03 周五 13:47] =>  0:09
    CLOCK: [2017-03-03 周五 13:26]--[2017-03-03 周五 13:37] =>  0:11
    CLOCK: [2017-03-04 周六 09:26]--[2017-03-04 周六 10:20] =>  0:54
    :END:
    - windows 下 ditaa 可用，但问题不少，具体有以下
      - '<' 无法画出
      - 中文支持极差
      - 颜色显示问题
       
*** DONE 取护照
    CLOSED: [2017-03-04 周六 10:22] SCHEDULED: <2017-03-03 周五 16:10>
    :PROPERTIES:
    :CREATED:  [2017-03-03 周五 15:25]
    :END:
*** DONE Matplotlib 学习使用基础
    CLOSED: [2017-03-06 周一 09:08] SCHEDULED: <2017-03-06 周一 09:00>
    :PROPERTIES:
    :CREATED:  [2017-03-05 周日 10:33]
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-05 周日 13:59]--[2017-03-05 周日 14:24] =>  0:25
    CLOCK: [2017-03-05 周日 13:28]--[2017-03-05 周日 13:53] =>  0:25
    CLOCK: [2017-03-05 周日 12:30]--[2017-03-05 周日 12:55] =>  0:25
    :END:
*** DONE Plantuml 学习
    CLOSED: [2017-03-06 周一 19:39] SCHEDULED: <2017-03-06 周一 19:00>
    :PROPERTIES:
    :CREATED:  [2017-03-06 周一 17:10]
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-06 周一 19:13]--[2017-03-06 周一 19:39] =>  0:26
    CLOCK: [2017-03-06 周一 18:52]--[2017-03-06 周一 18:59] =>  0:07
    :END:
** Projects
*** TODO 机器学习基础 [0/14]
    SCHEDULED: <2017-03-03 周五 10:35>
    :LOGBOOK:
    CLOCK: [2017-03-07 周二 10:39]--[2017-03-07 周二 11:09] =>  0:30
    CLOCK: [2017-03-07 周二 10:09]--[2017-03-07 周二 10:34] =>  0:25
    CLOCK: [2017-03-06 周一 14:28]--[2017-03-06 周一 14:59] =>  0:31
    CLOCK: [2017-03-06 周一 13:49]--[2017-03-06 周一 14:17] =>  0:28
    CLOCK: [2017-03-06 周一 10:32]--[2017-03-06 周一 10:57] =>  0:25
    CLOCK: [2017-03-06 周一 09:42]--[2017-03-06 周一 10:07] =>  0:25
    CLOCK: [2017-03-06 周一 09:09]--[2017-03-06 周一 09:34] =>  0:25
    CLOCK: [2017-03-05 周日 10:35]--[2017-03-05 周日 11:00] =>  0:25
    CLOCK: [2017-03-04 周六 22:56]--[2017-03-04 周六 23:21] =>  0:25
    CLOCK: [2017-03-03 周五 09:52]--[2017-03-03 周五 10:17] =>  0:25
    CLOCK: [2017-03-02 周四 22:32]--[2017-03-02 周四 22:57] =>  0:25
    CLOCK: [2017-03-02 周四 15:55]--[2017-03-02 周四 16:20] =>  0:25
    :END:
    - [ ] 基础，关于性能评估
    - [ ] 决策树
    - [ ] 最近邻规则 -- KNN 分类应用
    - [ ] 支持向量机上
    - [ ] 神经网络
    - [ ] 简单线性回归
    - [ ] 多元线性回归
    - [ ] 非线性回归 -- Logistic Regression
    - [ ] 神经网络 -- NN 算法
    - [ ] 支持向量机下
    - [ ] 回归中的相关度和决定系数
    - [ ] 回归中的相关性和 R 平方值应用
    - [ ] K-means 算法
    - [ ] 层次聚类
*** TODO 机器学习与量化交易班 [1/10]
    SCHEDULED: <2017-03-07 周二 14:40>
    :LOGBOOK:
    CLOCK: [2017-03-07 周二 18:46]--[2017-03-07 周二 19:11] =>  0:25
    CLOCK: [2017-03-07 周二 17:21]--[2017-03-07 周二 17:30] =>  0:09
    CLOCK: [2017-03-07 周二 16:50]--[2017-03-07 周二 17:15] =>  0:25
    CLOCK: [2017-03-07 周二 14:43]--[2017-03-07 周二 15:08] =>  0:25
    CLOCK: [2017-03-06 周一 17:15]--[2017-03-06 周一 17:54] =>  0:39
    CLOCK: [2017-03-06 周一 16:37]--[2017-03-06 周一 17:02] =>  0:25
    CLOCK: [2017-03-06 周一 15:57]--[2017-03-06 周一 16:22] =>  0:25
    CLOCK: [2017-03-06 周一 15:27]--[2017-03-06 周一 15:52] =>  0:25
    :END:
    
    - [X] 课一：
    - [ ] 课二：
    - [ ] 课三：
    - [ ] 课四：
    - [ ] 课五：
    - [ ] 课六：
    - [ ] 课七：
    - [ ] 课八：
    - [ ] 课九：
    - [ ] 课十：
      
* Habit

** NEXT 健身
 [2017-03-01 周三 12:26]
 [[file:~/workflow/main/gtd.org::*Habit][Habit]]
 SCHEDULED: <2017-03-01 周三 16:00 .+1d>
 :PROPERTIES:
 :STYLE: habit
 :REPEAT_TO_STATE: NEXT
 :END:
** NEXT 盘账
 [2017-03-02 周四 15:54]
 [[file:~/workflow/main/gtd.org::*Habit][Habit]]
 SCHEDULED: <2017-03-02 周四 22:00 .+1d>
 :PROPERTIES:
 :STYLE: habit
 :REPEAT_TO_STATE: NEXT
 :END:
** NEXT 吾日三省吾身
 [2017-03-06 周一 22:43]
 [[file:~/workflow/main/gtd.org::*Finance][Finance]]
 SCHEDULED: <2017-03-06 周一 22:00 .+1d>
 SCHEDULED: <2017-03-06 周二 9:30 .+1d>
 :PROPERTIES:
 :STYLE: habit
 :REPEAT_TO_STATE: NEXT
 :END:
* Finance

** 2017/03
*** Day3

    |----------+-----------------------------+----------|
    | 支出类别 | 支出明细                    | 支出金额 |
    |----------+-----------------------------+----------|
    | 早餐     | (星巴克) 大杯拿铁，提子多士 |    41.00 |
    | 午餐     | 韭黄炒蛋，花菜炒肉          |     4.80 |
    | 非必要   | (微咖) 拿铁                 |    20.00 |
    | 晚饭     | 杏鲍菇，番茄炒蛋            |     8.90 |
    |----------+-----------------------------+----------|
    | 合计     |                             |    74.70 |
    |----------+-----------------------------+----------|
*** Day4
    
    |----------+------------------------+----------|
    | 支出类别 | 支出明细               | 支出金额 |
    |----------+------------------------+----------|
    | 早饭     | 白粥、蛋挞、鸡蛋饼     |     3.70 |
    | 非必要   | (微咖) 拿铁            |    20.00 |
    | 午饭     | 虾，韭黄炒蛋，麻婆豆腐 |    12.30 |
    | 晚饭     | 炭烧鸡翅饭，卤蛋       |    21.00 |
    | 饮料     | 佳得乐                 |     4.00 |
    |----------+------------------------+----------|
    | 总计     |                        |    61.00 |
    |----------+------------------------+----------|
*** Day5

    |----------+-------------------------+----------|
    | 支出类别 | 支出明细                | 支出金额 |
    |----------+-------------------------+----------|
    | 早饭     | (星巴克) 拿铁，提子多士 |    10.00 |
    | 午饭     | 杏鲍菇，西兰花          |    10.80 |
    | 非必要   | (微咖) 拿铁             |    20.00 |
    | 晚饭     |                         |          |
    |----------+-------------------------+----------|
    | 总计     |                         |          |
    |----------+-------------------------+----------|

*** Day6

    |----------+--------------------+----------|
    | 支出类别 | 支出明细           | 支出金额 |
    |----------+--------------------+----------|
    | 早饭     | 鸡蛋饼，蛋挞，白粥 |     4.70 |
    | 非必要   | (微咖) 拿铁        |    20.00 |
    | 午饭     | 芹菜炒肉，菠萝番茄 |      7.6 |
    | 非必要   | (星巴克) 拿铁      |    31.00 |
    | 晚饭     | 芹菜炒肉，花菜炒肉 |      6.8 |
    | 水果     | 桂庙水果町         |    16.80 |
    |----------+--------------------+----------|
    | 总计     |                    |     86.9 |
    |----------+--------------------+----------|

*** Day7

    |----------+--------------------------+----------|
    | 支出类别 | 支出明细                 | 支出金额 |
    |----------+--------------------------+----------|
    | 早饭     | (星巴克)馥芮白，提子多士 |    13.00 |
    | 午饭     | 麻婆豆腐，木耳，平菇     |     9.10 |
    | 非必要   | (微咖) 拿铁              |    20.00 |
    | 晚饭     | 冒菜                     |    26.00 |
    |----------+--------------------------+----------|
    | 总计     |                          |          |
    |----------+--------------------------+----------|
